tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
brew "glib"
brew "openssl@1.1"
brew "python@3.9"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "ruby"
brew "cocoapods"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "harfbuzz"
brew "libass"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "node"
brew "gatsby-cli"
brew "git"
brew "go"
brew "python@3.11"
brew "gobject-introspection"
brew "groonga"
brew "libfido2"
brew "mariadb"
brew "node@16"
brew "mongosh"
brew "nginx"
brew "node@18"
brew "nvm"
brew "openapi-generator"
brew "protobuf"
brew "protobuf@3"
brew "python@3.10"
brew "rust"
brew "typescript"
brew "watchman"
brew "yarn", link: false
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "mongodb/brew/mongodb-community"
cask "docker"
cask "dotnet-sdk"
cask "fig"
cask "flutter"
cask "ghidra"
cask "mysqlworkbench"
cask "notion"
cask "slack"
cask "visual-studio-code"
vscode "aaravb.chrome-extension-developer-tools"
vscode "alexcvzz.vscode-sqlite"
vscode "bradlc.vscode-tailwindcss"
vscode "chris-noring.node-snippets"
vscode "cschlosser.doxdocgen"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "ExpressSnippets.vscode-express-snippets"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "golang.go-nightly"
vscode "Gruntfuggly.todo-tree"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jobkaeHenry.zustand-snippet"
vscode "KevinRose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ko"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "mwpb.java-prettier-formatter"
vscode "PKief.material-icon-theme"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "WakaTime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
